#include <iostream>
#include <math.h>
#include <string>
#include  <ctime>

using namespace std;

void square()                                                                         // решение квадратного уравнения с коэффициентами a = 5, b = 11, c = 2
{
    double a = 5, b = 11, c = 2;                                                         // коэффициенты 
    double x1, x2;                                                                    // корни
    int d = b * b - 4 * a * c;                                                        // дискриминант
    if (d > 0)                                                                        // когда дискриминант положительный
    {
        x1 = ((-b) - sqrt(d)) / (2 * a);
        x2 = ((-b) + sqrt(d)) / (2 * a);
        cout << "Первый корень: " << x1 << endl << "Второй корень: " << x2 << endl;
    }
    if (d == 0)                                                                       // когда дискриминант = 0
    {
        x1 = (-b) / (2 * a);
        cout << "Корень: " << x1 << endl;
    }
    if (d < 0)                                                                        // когда дискриминант меньше нуля
    {
        cout << "Корней нет" << endl;
    }
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void randnum()                                         // получение случайного числа в диапозоне от -100 до 100
{
    int a = -100, b = 100;                             // границы диапазона 
    int c = (rand() % (b - a + 1) + a);                // случайное число
    cout << c << endl;        
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void puz()                                          // сортировка пузырьком
{
    int arr[10];                                    // массив
    int temp;                                       // вспомогательная перменная для сортировки
    for (int i = 0; i < 10; i++)                    // заполнение массива случайными числами от 0 до 100
        arr[i] = rand() % 100;;
    for (int i = 0; i < 10; i++)                    // вывод массива
        cout << arr[i] << ' ';
        cout << endl;
        cout << endl;
    for (int i = 0; i < 10 - 1; i++)                // сортировка
    {
        for (int j = 0; j < 10 - i - 1; j++)
        {
            if (arr[j] > arr[j + 1])
            {
                temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;
            }
        }
    }
    for (int i = 0; i < 10; i++)                    // вывод массива
        cout << arr[i] << ' ';
    cout << endl;
    cout << endl;
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

int main()
{
    setlocale(LC_ALL, "RUS");
    srand(time(NULL));

    square();
    cout << endl;
    randnum();
    cout << endl;
    puz();
}
