#include <iostream>
#include  <ctime>

using namespace std;

void fNum()
{
	int num;
	int n[5];                                                   // Массив для хранения чисел 
	cout << "Введите пятизначное число" << endl;                // Ввод пятизначного числа
	cin >> num;
	cout << endl;
	for (int i = 0; i < 5; i++)                                 // Заполение массива путем деления числна на десять без остатка 
	{
		n[i] = num % 10;
    	num = num / 10;
	}

	for (int i = 4; i > -1; i--)								// Вывод цыфр числа построчно
	{
		cout << n[i] << endl;
		
	}
	cout << endl;
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void reg()                                                           //Изменение регистра
{
	char s;                                                          //Вводимая буква
	cout << "Введите латинскую букву в нижнем регистре:" << endl;
	cin >> s;
	s -= 32;                                                         //Изменение интового значения буквы по таблице ASCII
	cout << "Буква в верхнем регистре: " << s << endl << endl;               //Вывод
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

void arithMean()                                                             // Подсчёт среденго арифметического массива
{
	const int size = 10;                                                     // Размер массива
	int s = 0;                                                               // Переменная для подсчёта суммы элементов массива
		int array[size];                                                     // Массив 
	for (int i = 0; i < size; i++)                                           // Заполнение массива случайными числами от 0 до 100
		array[i] = rand() % 100;
	cout << "Массив:" << endl;                                               // Вывод массива
	for (int i = 0; i < size; i++)
		cout << array[i] << ' ';
	cout << endl;
	for (int i = 0; i < size; i++)                                           //Подсчёт суммы всех элементов массива
		s += array[i];
	cout << "Среднее арифметическое массива: " << double(s) / size << endl;  // Вывод среднего арифметического
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

int main()
{
	setlocale(LC_ALL, "RUS");
	srand(time(NULL));

	fNum();
	reg();
	arithMean();

}