#include <iostream>
#include <string>

using namespace std;

void mas()                          // замена четных чисел на 0
{
    int a[10];
    for (int i = 0; i < 10; i++)
        a[i] = rand() % 100;        // заполнение массива случайными числами от 0 до 100
    for (int i = 0; i < 10; i++)
        cout << a[i] << ' ';
    cout << endl;
    cout << endl;

    for (int i = 0; i < 10; i++)
        if (a[i] % 2 == 0) a[i] = 0;
    for (int i = 0; i < 10; i++)

        cout << a[i] << ' ' << endl;
}

///////////////////////////////////////////////////////////////////////////////////////////////

void sim()                                                                     // поиск символа в строке
{
    string symbol, row;                                                        // symbol - символ, row - строка
    int g;                                                                     // g - место символа в строке
    cout << endl;
    cout << "Введите один символ: " << endl;
    do {
        cin >> symbol;
        if (symbol.size() > 1)
        {
            cout << "Введите ТОЛЬКО ОДИН символ:" << endl;                     // проверка, что введен один символ
            symbol.clear();
        }
        else
            break;
    } while (1);

    cout << "Введите строку: " << endl;
    do {
        cin >> row;
        if (row.size() < 2)
        {
            cout << "Введите строку( два и более символа ): " << endl;         // проверка, что введена строка
            row.clear();
        }
        else
            break;
    } while (1);

    g = row.find(symbol);                                                      // поиск символа в строке
    if (g < 0) cout << "Символа в строке нет " << endl;
    else cout << "Символ занимает " << g + 1 << " позицию" << endl;
}

///////////////////////////////////////////////////////////////////////////////////////////////

void determinant()
{
    int det;                                                        //определитель
    int m[3][3];                                                    //матрица 3 на 3

    cout << endl << "Введите целые числа построчно" << endl;        // ввод матрицы
    for (int i = 0; i < 3; i++)
        for (int j = 0; j < 3; j++)
            cin >> m[i][j];

    for (int i = 0; i < 3; i++)                                     // вывод матрицы
    {
        cout << endl;
        for (int j = 0; j < 3; j++)
            cout << m[i][j] << " ";
    }
    //поиск определителя матрицы
    det = m[0][0] * m[1][1] * m[2][2] + m[2][0] * m[0][1] * m[1][2] + m[1][0] * m[2][1] * m[0][2] - m[2][0] * m[1][1] * m[0][2] - m[0][0] * m[2][1] * m[1][2] - m[1][0] * m[0][1] * m[2][2];

    cout << endl;
    cout << endl << "Определитель матрицы: " << det << endl;
}

///////////////////////////////////////////////////////////////////////////////////////////////

int main()
{
    setlocale(LC_ALL, "RUS");
    mas();
    sim();
    determinant();
}